In [3]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import pymysql
import getpass

In [5]:
password = getpass.getpass()

········

In [15]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [28]:
data = pd.read_sql_query("""SELECT * FROM rental""", engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [77]:
# min date is '2005-05-24 22:53:30' and max date is '2006-02-14 15:16:03'
def rental_months(engine, month: int, year: int)-> pd.DataFrame:
    """
    Function: Return a dataframe from an SQL query for a specific month and year from the sakila.rental table. 
    Inputs: engine for SQL connection, month to query for, year to query for. 
    Output: pandas dataframe. 
    Note: for sakila.rental table, date range is between min date '2005-05-24 22:53:30' and max date '2006-02-14 15:16:03'
    """
    query = """
    SELECT * 
    FROM sakila.rental 
    WHERE MONTH(rental_date) = """+str(month)+""" AND YEAR(rental_date) = """+str(year)+"""
    """
    data = pd.read_sql_query(query, engine)
    if len(data) == 0:
        print("No data available for this timeframe")
    return data

In [81]:
def rental_count_month(engine, month:int, year:int):
    """
    Function: Query SQL db from rentals_month() function, and count the number of rentals in that given time period per customer_id.
    Inputs: engine for sql db connection, month and year for SQL query
    Output: pandas dataframe grouped by customer_id and counting the number of rentals per customer in given month and year.
    """
    data = rental_months(engine, month, year)
    grouped_data = data.groupby('customer_id')['rental_id'].count().reset_index().rename(
    columns={'rental_id':'rentals_'+str(month)+'_'+str(year)})
    return grouped_data

In [114]:
def compare_rentals(engine, month_1, month_2, year_1, year_2):
    """
    Function: Performs two functions (rental_count_month and rental_month) to return two dataframe from sakila.rental table 
    from two different queried time periods based on month and year. Merges these two dataframes horizontally based on customer_id 
    and then adds additional column to show difference between the two months.
    Inputs: month_1 and year_1 for first dataset returned from sakila.rental, month_2 and year_2 for second 
    dataset to then merge with first.  
    Outputs: dataframe with 4 columns, customer_id, rentals for first period, rentals for second period and 
    difference between for each customer
    """
    grouped_data_1 = rental_count_month(engine, month_1, year_1)
    grouped_data_2 = rental_count_month(engine, month_2, year_2)
    first_col = grouped_data_1.columns[1]
    second_col = grouped_data_2.columns[1]
    merged_df = grouped_data_1.merge(grouped_data_2)
    merged_df['difference'] = merged_df[first_col] - merged_df[second_col]
    return merged_df

In [113]:
# Testing function out
compare_rentals(engine, 7, 6, 2005, 2005)

     customer_id  rentals_7_2005  rentals_6_2005  difference
0              1              12               7           5
1              2              14               1          13
2              3              13               4           9
3              4               5               6          -1
4              5              16               5          11
..           ...             ...             ...         ...
585          595              19               2          17
586          596               6               2           4
587          597               7               3           4
588          598              16               1          15
589          599               7               4           3

[590 rows x 4 columns]